#include <iostream>
using namespace std;

int main()
{
    /********************************************************
     * 跳转语句有以下三种：
     * 1. break
     *    用于跳出选择结构或者循环结构
     * 2. continue
     *    跳过本次循环中余下尚未执行的语句，继续执行下一次循环
     * 3. goto
     *    如果标记的名称存在，执行到goto语句时，会跳转到标记的位置
     *********************************************************/

    for (int i = 0; i < 100; i++)
    {
        if (i % 2 == 0)
        {
            continue;
        }
        cout << i << endl;
    }

    for (int i = 0; i < 100; i++)
    {
        if (i == 15)
        {
            break;
        }
        cout << i << endl;
    }
}